CS169.1x-sw-as-service/week5/rottenpotatoes/app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" = 'George Lucas'
---
  def similar
    @id = params[:movie_id]
    @movie = Movie.find(@id)
    @director = @movie.director
    if @director.blank?
      flash[:notice] = "#Error: '#{@movie.title}' has no director info."
      redirect_to movies_path
    else
      @movies = Movie.find_similar(@director)