CS169.1x-sw-as-service/week3/app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE (rating IN ('G','PG-13','R')) ORDER BY release_date
---
  def index
    @all_ratings = Movie.rate_codes
    @selected = 'hilite'
    # store settings
    session[:ratings] = params[:ratings] unless params[:ratings].nil?
    session[:sort] = params[:sort] unless params[:sort].nil?
    if params[:ratings].nil?
      # no box checked: first access (display all movies) or use session data
      session[:ratings].nil? ? @checks = @all_ratings : @checks = session[:ratings]
      # check if sorting is needed
      params[:sort].nil? ? @movies = Movie.all : @movies = Movie.order(params[:sort])